/*******************************************************************************
 FILE         :   BTFIELD.H

 COPYRIGHT    :   R-Style Software Lab, 1998

 DESCRIPTION  :   Working field of Btrieve-files for AS/400

 PROGRAMMED BY:   Alexey Lebedev

 CREATION DATE:   20 Jul 1999

 VERSION INFO :   $Archive: /RS-Tools/Old_tools/BEDIT/H/dbtrv/btfield.h $
                  $Revision: 2 $
                  $Date: 22.10.99 18:07 $
                  $Author: Lebedev $
                  $Modtime: 22.10.99 18:06 $
*******************************************************************************/

#ifndef __BTFIELD_H
#define __BTFIELD_H

#include <stddef.h>

/*******************************************************************************
 Ограничения по длине элементов описания файла
 *******************************************************************************/
enum
   {
    BTMaxFldName  = 10,
    BTMaxFldText  = 50,
    BTMaxFldAlias = 30
   };

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 Добавить имя, комментарий или псевдоним имени в цепочку строк.
 Перед добавлением возможно изменение исходной строки - из нее удаляются
 недопустимые в цепочке символы.

 Параметры:
 chain  - цепочка строк
 name, text, alias - строка с именем, комментарием или псевдонимом
 length - текущая длина цепочки

 Возвращается новая длина цепочки в байтах.
 *******************************************************************************/
size_t linkFldName (char *chain, size_t length, const char *name);
size_t linkFldText (char *chain, size_t length, const char *text);
size_t linkFldAlias(char *chain, size_t length, const char *alias);

/*******************************************************************************
 Обработать цепочки имен и псевдонимов имен.
 Для формирования уникальных имен полей и несовпадающих с ними и между собой
 псевдонимов. Результат помещается в исходные строки, которые должны быть
 на это рассчитаны.

 Параметры:
 name  - цепочка имен полей
 alias - цепочка псевдонимов имен полей
 *******************************************************************************/
extern void namingFld(char *name, char *alias);

#ifdef __cplusplus
};
#endif

#endif // __BTFIELD_H

/* <-- EOF --> */