/************************************************************************
         Меню система для Turbo C 2.1
         VECsoft 12.04.91

   VERSION INFO :   $Archive: /RS-Tools/Old_tools/PANEL/H/wrap.h $
                    $Revision: 4 $
                    $Date: 27.11.98 20:20 $
                    $Author: Lebedev $
                    $Modtime: 27.11.98 20:04 $
************************************************************************/

#include "pexpdef.h"

#ifdef __cplusplus
 extern "C" {
#endif

/* Рассечение строки             */
/* Возвращает массив указателей на куски */
_RSPNLEXP char **wrap(
                      const char *s,     /* Строка               */
                      int         l,     /* Длина куска             */
                      int         h,     /* Минимальное число кусков        */
                      int        *n      /* Число кусков               */
                     );

/* Освобождение рассеченной строки     */
_RSPNLEXP void freewrap(
                        char **w,    /* Массив указателей на куски       */
                        int    n     /* Число кусков               */
                       );

/* Объединение рассеченной строки      */
/* и освобождение памяти        */
void unwrap(
            char **w,    /* Массив указателей на куски       */
            int    n,    /* Число кусков               */
            char  *s,    /* Строка               */
            int    p     /* Память под строку          */
           );

#ifdef __cplusplus
 } ;
#endif

/* <-- EOF --> */